{
"recipes": [
  {
    "title": "Slow Cooker Chicken and Dumplings",
    "ingredients": [
      "4 skinless, boneless chicken breast halves ADVERTISEMENT",
      "2 tablespoons butter ADVERTISEMENT",
      "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
      "1 onion, finely diced ADVERTISEMENT",
      "2 (10 ounce) packages refrigerated biscuit dough, torn into pieces ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Place the chicken, butter, soup, and onion in a slow cooker, and fill with enough water to cover.\nCover, and cook for 5 to 6 hours on High. About 30 minutes before serving, place the torn biscuit dough in the slow cooker. Cook until the dough is no longer raw in the center.\n",
    "picture_link": "55lznCYBbs2mT8BTx6BTkLhynGHzM.S"
  },
  {
    "title": "Awesome Slow Cooker Pot Roast",
    "ingredients": [
      "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
      "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
      "1 1/4 cups water ADVERTISEMENT",
      "5 1/2 pounds pot roast ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "In a slow cooker, mix cream of mushroom soup, dry onion soup mix and water. Place pot roast in slow cooker and coat with soup mixture.\nCook on High setting for 3 to 4 hours, or on Low setting for 8 to 9 hours.\n",
    "picture_link": "QyrvGdGNMBA2lDdciY0FjKu.77MM0Oe"
  },
  {
    "title": "Brown Sugar Meatloaf",
    "ingredients": [
      "1/2 cup packed brown sugar ADVERTISEMENT",
      "1/2 cup ketchup ADVERTISEMENT",
      "1 1/2 pounds lean ground beef ADVERTISEMENT",
      "3/4 cup milk ADVERTISEMENT",
      "2 eggs ADVERTISEMENT",
      "1 1/2 teaspoons salt ADVERTISEMENT",
      "1/4 teaspoon ground black pepper ADVERTISEMENT",
      "1 small onion, chopped ADVERTISEMENT",
      "1/4 teaspoon ground ginger ADVERTISEMENT",
      "3/4 cup finely crushed saltine cracker crumbs ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 5x9 inch loaf pan.\nPress the brown sugar in the bottom of the prepared loaf pan and spread the ketchup over the sugar.\nIn a mixing bowl, mix thoroughly all remaining ingredients and shape into a loaf. Place on top of the ketchup.\nBake in preheated oven for 1 hour or until juices are clear.\n",
    "picture_link": "LVW1DI0vtlCrpAhNSEQysE9i/7rJG56"
  },
  {
    "title": "Best Chocolate Chip Cookies",
    "ingredients": [
      "1 cup butter, softened ADVERTISEMENT",
      "1 cup white sugar ADVERTISEMENT",
      "1 cup packed brown sugar ADVERTISEMENT",
      "2 eggs ADVERTISEMENT",
      "2 teaspoons vanilla extract ADVERTISEMENT",
      "3 cups all-purpose flour ADVERTISEMENT",
      "1 teaspoon baking soda ADVERTISEMENT",
      "2 teaspoons hot water ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "2 cups semisweet chocolate chips ADVERTISEMENT",
      "1 cup chopped walnuts ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water. Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.\nBake for about 10 minutes in the preheated oven, or until edges are nicely browned.\n",
    "picture_link": "0SO5kdWOV94j6EfAVwMMYRM3yNN8eRi"
  },
  {
    "title": "Homemade Mac and Cheese Casserole",
    "ingredients": [
      "8 ounces whole wheat rotini pasta ADVERTISEMENT",
      "3 cups fresh broccoli florets ADVERTISEMENT",
      "1 medium onion, chopped ADVERTISEMENT",
      "3 cloves garlic, minced ADVERTISEMENT",
      "4 tablespoons butter, divided ADVERTISEMENT",
      "2 tablespoons all-purpose flour ADVERTISEMENT",
      "1/4 teaspoon salt ADVERTISEMENT",
      "1/8 teaspoon ground black pepper ADVERTISEMENT",
      "2 1/2 cups milk ADVERTISEMENT",
      "8 ounces Cheddar cheese, shredded ADVERTISEMENT",
      "4 ounces reduced-fat cream cheese, cubed and softened ADVERTISEMENT",
      "1/2 cup fine dry Italian-seasoned bread crumbs ADVERTISEMENT",
      "Reynolds Wrap® Non Stick Aluminum Foil ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F. Line a 2-quart casserole dish with Reynolds Wrap(R) Pan Lining Paper, parchment side up. No need to grease dish.\nCook the pasta in a large saucepan according to the package directions, adding the broccoli for the last 3 minutes of cooking. Drain. Return to the saucepan and set aside.\nCook the onion and garlic in 2 tablespoons hot butter in a large skillet 5 to 7 minutes or until tender. Stir in flour, salt, and black pepper. Add the milk all at once. Cook and stir over medium heat until slightly thickened and bubbly. Add cheddar cheese and cream cheese, stirring until melted. Pour cheese sauce over the pasta and broccoli and stir until well combined.\nMelt the remaining 2 tablespoons butter and mix with the bread crumbs in a small bowl. Transfer the pasta mixture to the prepared casserole dish. Top with the buttery bread crumbs.\nBake, uncovered, about 25 minutes or until bubbly and internal temperature is 165 degrees F. Let stand for 10 minutes before serving.\n",
    "picture_link": "YCnbhplMgiraW4rUXcybgSEZinSgljm"
  },
  {
    "title": "Banana Banana Bread",
    "ingredients": [
      "2 cups all-purpose flour ADVERTISEMENT",
      "1 teaspoon baking soda ADVERTISEMENT",
      "1/4 teaspoon salt ADVERTISEMENT",
      "1/2 cup butter ADVERTISEMENT",
      "3/4 cup brown sugar ADVERTISEMENT",
      "2 eggs, beaten ADVERTISEMENT",
      "2 1/3 cups mashed overripe bananas ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.\nBake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack.\n",
    "picture_link": "jRnWGDXDdyOg3rta4/HVAR2rD19XubC"
  },
  {
    "title": "Chef John's Fisherman's Pie",
    "ingredients": [
      "For potato crust: ADVERTISEMENT",
      "3 russet potatoes, peeled and cut into chunks ADVERTISEMENT",
      "3 tablespoons butter ADVERTISEMENT",
      "1 pinch freshly grated nutmeg ADVERTISEMENT",
      "salt and ground black pepper to taste ADVERTISEMENT",
      "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
      "1/2 cup milk ADVERTISEMENT",
      "For the spinach: ADVERTISEMENT",
      "2 teaspoons olive oil ADVERTISEMENT",
      "12 ounces baby spinach leaves ADVERTISEMENT",
      "For the sauce: ADVERTISEMENT",
      "3 tablespoons butter ADVERTISEMENT",
      "3 tablespoons all-purpose flour ADVERTISEMENT",
      "2 cloves garlic, minced ADVERTISEMENT",
      "2 cups cold milk, divided ADVERTISEMENT",
      "2 teaspoons lemon zest ADVERTISEMENT",
      "For the rest: ADVERTISEMENT",
      "1 tablespoon butter ADVERTISEMENT",
      "salt and ground black pepper to taste ADVERTISEMENT",
      "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
      "2 pounds boneless cod fillets ADVERTISEMENT",
      "1/2 lemon, juiced ADVERTISEMENT",
      "1 tablespoon chopped fresh chives for garnish ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Bring a large saucepan of salted water and to a boil; add russet potatoes to boiling water and cook until very tender, about 20 minutes. Drain well. Mash in 3 tablespoons butter until thoroughly combined. Season with nutmeg, salt, black pepper, and cayenne pepper to taste. Mash 1/2 cup milk into potato mixture until smooth.\nDrizzle olive oil in a large Dutch oven over medium-high heat, add spinach, and season with a big pinch of salt. Cook, stirring occasionally, until spinach has wilted, about 1 minute. Transfer to a bowl lined with paper towels to wick away excess moisture.\nHeat 3 tablespoons butter and flour in a saucepan over medium heat; whisk mixture to a smooth paste. Cook, stirring constantly, until mixture has a nutty smell and is slightly browned, about 2 minutes. Add chopped garlic; whisk until fragrant, 10 to 20 seconds.\nWhisk 1 cup cold milk into flour mixture; cook until thickened. Whisk in remaining 1 cup milk and lemon zest. Bring white sauce to a gentle simmer, whisking constantly; season with salt. Turn heat to very low and keep sauce warm.\nPreheat oven to 375 degrees F (190 degrees C). Grease an 8x12-inch casserole dish with 1 tablespoon butter.\nSeason buttered pan with salt, black pepper, and cayenne pepper. Lay boneless cod fillets into the pan in a single layer. Season tops of fillets with more salt, black pepper, and cayenne pepper. Spread spinach evenly over fish and drizzle with lemon juice. Spoon white sauce over spinach; give casserole dish several taps and shakes to eliminate bubbles.\nDrop mashed potatoes by heaping spoonfuls over the casserole and spread smoothly to cover. Place dish onto a rimmed baking sheet to catch spills.\nBake in the preheated oven until bubbling, about 40 minutes. Turn on oven's broiler and broil until potato crust has a golden brown top, about 2 minutes. Fish should flake easily. Let stand 10 minutes before serving. Garnish with a sprinkle of chives.\n",
    "picture_link": "aUca10AaD8T2yYvcLOgH/UJlR5/OhOe"
  },
  {
    "title": "Mom's Zucchini Bread",
    "ingredients": [
      "3 cups all-purpose flour ADVERTISEMENT",
      "1 teaspoon salt ADVERTISEMENT",
      "1 teaspoon baking soda ADVERTISEMENT",
      "1 teaspoon baking powder ADVERTISEMENT",
      "1 tablespoon ground cinnamon ADVERTISEMENT",
      "3 eggs ADVERTISEMENT",
      "1 cup vegetable oil ADVERTISEMENT",
      "2 1/4 cups white sugar ADVERTISEMENT",
      "3 teaspoons vanilla extract ADVERTISEMENT",
      "2 cups grated zucchini ADVERTISEMENT",
      "1 cup chopped walnuts ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Grease and flour two 8 x 4 inch pans. Preheat oven to 325 degrees F (165 degrees C).\nSift flour, salt, baking powder, soda, and cinnamon together in a bowl.\nBeat eggs, oil, vanilla, and sugar together in a large bowl. Add sifted ingredients to the creamed mixture, and beat well. Stir in zucchini and nuts until well combined. Pour batter into prepared pans.\nBake for 40 to 60 minutes, or until tester inserted in the center comes out clean. Cool in pan on rack for 20 minutes. Remove bread from pan, and completely cool.\n",
    "picture_link": "YdgEVyLVffZgh9NZPN3Eqj6MaX8KdzK"
  },
  {
    "title": "The Best Rolled Sugar Cookies",
    "ingredients": [
      "1 1/2 cups butter, softened ADVERTISEMENT",
      "2 cups white sugar ADVERTISEMENT",
      "4 eggs ADVERTISEMENT",
      "1 teaspoon vanilla extract ADVERTISEMENT",
      "5 cups all-purpose flour ADVERTISEMENT",
      "2 teaspoons baking powder ADVERTISEMENT",
      "1 teaspoon salt ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight).\nPreheat oven to 400 degrees F (200 degrees C). Roll out dough on floured surface 1/4 to 1/2 inch thick. Cut into shapes with any cookie cutter. Place cookies 1 inch apart on ungreased cookie sheets.\nBake 6 to 8 minutes in preheated oven. Cool completely.\n",
    "picture_link": "UrgvDGu4roLiho160fTVIwCUrGZna8i"
  },
  {
    "title": "Singapore Chili Crabs",
    "ingredients": [
      "Sauce: ADVERTISEMENT",
      "1/2 cup ketchup ADVERTISEMENT",
      "1/2 cup chicken broth ADVERTISEMENT",
      "1 large egg ADVERTISEMENT",
      "2 tablespoons soy sauce ADVERTISEMENT",
      "2 tablespoons chile-garlic sauce (such as sambal oelek) ADVERTISEMENT",
      "1 tablespoon oyster sauce ADVERTISEMENT",
      "1 tablespoon tamarind paste ADVERTISEMENT",
      "2 teaspoons fish sauce ADVERTISEMENT",
      "2 teaspoons palm sugar ADVERTISEMENT",
      "1/4 cup minced shallot ADVERTISEMENT",
      "6 cloves garlic, minced ADVERTISEMENT",
      "2 tablespoons vegetable oil, or more as needed ADVERTISEMENT",
      "2 tablespoons minced fresh ginger root ADVERTISEMENT",
      "1 tablespoon minced serrano pepper ADVERTISEMENT",
      "2 cooked Dungeness crabs, cleaned and cracked ADVERTISEMENT",
      "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
      "2 tablespoons sliced green onion (green part only) ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Whisk ketchup, chicken broth, egg, soy sauce, chile-garlic sauce, oyster sauce, tamarind paste, fish sauce, and palm sugar together in a bowl.\nStir shallots, garlic, oil, ginger, and serrano pepper together in a pot over medium-high heat. Saute until sizzling, about 2 minutes. Add crab to pot, cover the pot with a lid, and shake until crab is completely coated in shallot mixture. Remove lid and cook and stir until heated through, about 3 minutes.\nPour ketchup mixture into pot, reduce heat to medium, and cook and stir until sauce thickens and crab is hot about 5 minutes. Remove from heat; stir in cilantro and green onions.\n",
    "picture_link": "OFp6yXFwzlrkMQ5STffYPllxQvMVLUS"
  },
  {
    "title": "Downeast Maine Pumpkin Bread",
    "ingredients": [
      "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
      "4 eggs ADVERTISEMENT",
      "1 cup vegetable oil ADVERTISEMENT",
      "2/3 cup water ADVERTISEMENT",
      "3 cups white sugar ADVERTISEMENT",
      "3 1/2 cups all-purpose flour ADVERTISEMENT",
      "2 teaspoons baking soda ADVERTISEMENT",
      "1 1/2 teaspoons salt ADVERTISEMENT",
      "1 teaspoon ground cinnamon ADVERTISEMENT",
      "1 teaspoon ground nutmeg ADVERTISEMENT",
      "1/2 teaspoon ground cloves ADVERTISEMENT",
      "1/4 teaspoon ground ginger ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.\nIn a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.\nBake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean.\n",
    "picture_link": "bhIlNeSZ4DJw12AqM8FmEjHBO0NTCGi"
  },
  {
    "title": "Best Big, Fat, Chewy Chocolate Chip Cookie",
    "ingredients": [
      "2 cups all-purpose flour ADVERTISEMENT",
      "1/2 teaspoon baking soda ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "3/4 cup unsalted butter, melted ADVERTISEMENT",
      "1 cup packed brown sugar ADVERTISEMENT",
      "1/2 cup white sugar ADVERTISEMENT",
      "1 tablespoon vanilla extract ADVERTISEMENT",
      "1 egg ADVERTISEMENT",
      "1 egg yolk ADVERTISEMENT",
      "2 cups semisweet chocolate chips ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper.\nSift together the flour, baking soda and salt; set aside.\nIn a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart.\nBake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely.\n",
    "picture_link": "EmmrsVyOmMlydE188t/S5gtqhqeENfO"
  },
  {
    "title": "Aimee's Mashed Cauliflower 'Potatoes'",
    "ingredients": [
      "1 pound cauliflower florets ADVERTISEMENT",
      "1/4 cup mashed potato flakes ADVERTISEMENT",
      "1/4 cup low-fat milk ADVERTISEMENT",
      "2 tablespoons margarine ADVERTISEMENT",
      "salt and ground black pepper to taste ADVERTISEMENT",
      "1/4 cup shredded reduced-fat Cheddar cheese ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, about 20 minutes. Transfer cauliflower to a large bowl. Add mashed potato flakes, milk, and margarine; mash with a potato masher or fork until cauliflower mixture is fluffy. Season with salt and black pepper. Pour mixture into a baking dish and sprinkle with Cheddar cheese.\nBake in preheated oven until cheese is melted, about 10 minutes.\n",
    "picture_link": "2TsioRcazbkIxICdD6kx8bSAcld0Ome"
  },
  {
    "title": "Irish Lamb Stew",
    "ingredients": [
      "1 1/2 pounds thickly sliced bacon, diced ADVERTISEMENT",
      "6 pounds boneless lamb shoulder, cut into 2 inch pieces ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "1/2 teaspoon ground black pepper ADVERTISEMENT",
      "1/2 cup all-purpose flour ADVERTISEMENT",
      "3 cloves garlic, minced ADVERTISEMENT",
      "1 large onion, chopped ADVERTISEMENT",
      "1/2 cup water ADVERTISEMENT",
      "4 cups beef stock ADVERTISEMENT",
      "2 teaspoons white sugar ADVERTISEMENT",
      "4 cups diced carrots ADVERTISEMENT",
      "2 large onions, cut into bite-size pieces ADVERTISEMENT",
      "3 potatoes ADVERTISEMENT",
      "1 teaspoon dried thyme ADVERTISEMENT",
      "2 bay leaves ADVERTISEMENT",
      "1 cup white wine ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble, and set aside.\nPut lamb, salt, pepper, and flour in large mixing bowl. Toss to coat meat evenly. Brown meat in frying pan with bacon fat.\nPlace meat into stock pot (leave 1/4 cup of fat in frying pan). Add the garlic and yellow onion and saute till onion begins to become golden. Deglaze frying pan with 1/2 cup water and add the garlic-onion mixture to the stock pot with bacon pieces, beef stock, and sugar. Cover and simmer for 1 1/2 hours.\nAdd carrots, onions, potatoes, thyme, bay leaves, and wine to pot. Reduce heat, and simmer covered for 20 minutes until vegetables are tender.\n",
    "picture_link": "oSTtB5z6PHj5hGqwP..pk7rwqzef5v6"
  },
  {
    "title": "To Die For Blueberry Muffins",
    "ingredients": [
      "1 1/2 cups all-purpose flour ADVERTISEMENT",
      "3/4 cup white sugar ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "2 teaspoons baking powder ADVERTISEMENT",
      "1/3 cup vegetable oil ADVERTISEMENT",
      "1 egg ADVERTISEMENT",
      "1/3 cup milk ADVERTISEMENT",
      "1 cup fresh blueberries ADVERTISEMENT",
      "1/2 cup white sugar ADVERTISEMENT",
      "1/3 cup all-purpose flour ADVERTISEMENT",
      "1/4 cup butter, cubed ADVERTISEMENT",
      "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.\nCombine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and enough milk to fill the cup. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.\nTo Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter, and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.\nBake for 20 to 25 minutes in the preheated oven, or until done.\n",
    "picture_link": "fnRIXaZevA9/KXRkgLd13a9qP7JQTya"
  },
  {
    "title": "Broiled Tilapia Parmesan",
    "ingredients": [
      "1/2 cup Parmesan cheese ADVERTISEMENT",
      "1/4 cup butter, softened ADVERTISEMENT",
      "3 tablespoons mayonnaise ADVERTISEMENT",
      "2 tablespoons fresh lemon juice ADVERTISEMENT",
      "1/4 teaspoon dried basil ADVERTISEMENT",
      "1/4 teaspoon ground black pepper ADVERTISEMENT",
      "1/8 teaspoon onion powder ADVERTISEMENT",
      "1/8 teaspoon celery salt ADVERTISEMENT",
      "2 pounds tilapia fillets ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat your oven's broiler. Grease a broiling pan or line pan with aluminum foil.\nIn a small bowl, mix together the Parmesan cheese, butter, mayonnaise and lemon juice. Season with dried basil, pepper, onion powder and celery salt. Mix well and set aside.\nArrange fillets in a single layer on the prepared pan. Broil a few inches from the heat for 2 to 3 minutes. Flip the fillets over and broil for a couple more minutes. Remove the fillets from the oven and cover them with the Parmesan cheese mixture on the top side. Broil for 2 more minutes or until the topping is browned and fish flakes easily with a fork. Be careful not to over cook the fish.\n",
    "picture_link": "8EYp6Ol.jsDv7u4PQS0AGonthM2zdOu"
  },
  {
    "title": "Award Winning Soft Chocolate Chip Cookies",
    "ingredients": [
      "4 1/2 cups all-purpose flour ADVERTISEMENT",
      "2 teaspoons baking soda ADVERTISEMENT",
      "2 cups butter, softened ADVERTISEMENT",
      "1 1/2 cups packed brown sugar ADVERTISEMENT",
      "1/2 cup white sugar ADVERTISEMENT",
      "2 (3.4 ounce) packages instant vanilla pudding mix ADVERTISEMENT",
      "4 eggs ADVERTISEMENT",
      "2 teaspoons vanilla extract ADVERTISEMENT",
      "4 cups semisweet chocolate chips ADVERTISEMENT",
      "2 cups chopped walnuts (optional) ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Sift together the flour and baking soda, set aside.\nIn a large bowl, cream together the butter, brown sugar, and white sugar. Beat in the instant pudding mix until blended. Stir in the eggs and vanilla. Blend in the flour mixture. Finally, stir in the chocolate chips and nuts. Drop cookies by rounded spoonfuls onto ungreased cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Edges should be golden brown.\n",
    "picture_link": "PqQB4r./GIiG1AqoXKdheQIvD91Qrh2"
  },
  {
    "title": "World's Best Lasagna",
    "ingredients": [
      "1 pound sweet Italian sausage ADVERTISEMENT",
      "3/4 pound lean ground beef ADVERTISEMENT",
      "1/2 cup minced onion ADVERTISEMENT",
      "2 cloves garlic, crushed ADVERTISEMENT",
      "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
      "2 (6 ounce) cans tomato paste ADVERTISEMENT",
      "2 (6.5 ounce) cans canned tomato sauce ADVERTISEMENT",
      "1/2 cup water ADVERTISEMENT",
      "2 tablespoons white sugar ADVERTISEMENT",
      "1 1/2 teaspoons dried basil leaves ADVERTISEMENT",
      "1/2 teaspoon fennel seeds ADVERTISEMENT",
      "1 teaspoon Italian seasoning ADVERTISEMENT",
      "1 tablespoon salt ADVERTISEMENT",
      "1/4 teaspoon ground black pepper ADVERTISEMENT",
      "4 tablespoons chopped fresh parsley ADVERTISEMENT",
      "12 lasagna noodles ADVERTISEMENT",
      "16 ounces ricotta cheese ADVERTISEMENT",
      "1 egg ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "3/4 pound mozzarella cheese, sliced ADVERTISEMENT",
      "3/4 cup grated Parmesan cheese ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 tablespoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.\nPreheat oven to 375 degrees F (190 degrees C).\nTo assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.\nBake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.\n",
    "picture_link": "MwTU49F./0X4dCuRQKW1OR2hT19l.xq"
  },
  {
    "title": "Best Brownies",
    "ingredients": [
      "1/2 cup butter ADVERTISEMENT",
      "1 cup white sugar ADVERTISEMENT",
      "2 eggs ADVERTISEMENT",
      "1 teaspoon vanilla extract ADVERTISEMENT",
      "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
      "1/2 cup all-purpose flour ADVERTISEMENT",
      "1/4 teaspoon salt ADVERTISEMENT",
      "1/4 teaspoon baking powder ADVERTISEMENT",
      "Frosting: ADVERTISEMENT",
      "3 tablespoons butter, softened ADVERTISEMENT",
      "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
      "1 tablespoon honey ADVERTISEMENT",
      "1 teaspoon vanilla extract ADVERTISEMENT",
      "1 cup confectioners' sugar ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.\nIn a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.\nBake in preheated oven for 25 to 30 minutes. Do not overcook.\nTo Make Frosting: Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm.\n",
    "picture_link": "6AyX9Y/Hh582pLBPWg7CbknovO0Xafe"
  },
  {
    "title": "Irish Soda Bread",
    "ingredients": [
      "1/2 cup white sugar ADVERTISEMENT",
      "4 cups all-purpose flour ADVERTISEMENT",
      "2 teaspoons baking powder ADVERTISEMENT",
      "1 teaspoon baking soda ADVERTISEMENT",
      "3/4 teaspoon salt ADVERTISEMENT",
      "3 cups raisins ADVERTISEMENT",
      "1 tablespoon caraway seeds ADVERTISEMENT",
      "2 eggs, lightly beaten ADVERTISEMENT",
      "1 1/4 cups buttermilk ADVERTISEMENT",
      "1 cup sour cream ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch round cast iron skillet or a 9 inch round baking or cake pan.\nIn a mixing bowl, combine flour (reserving 1 tablespoon), sugar, baking powder, baking soda, salt, raisins and caraway seeds. In a small bowl, blend eggs, buttermilk and sour cream. Stir the liquid mixture into flour mixture just until flour is moistened. Knead dough in bowl about 10 to 12 strokes. Dough will be sticky. Place the dough in the prepared skillet or pan and pat down. Cut a 4x3/4 inch deep slit in the top of the bread. Dust with reserved flour\nBake in a preheated 350 degrees F (175 degrees C) oven for 65 to 75 minutes. Let cool and turn bread onto a wire rack.\n",
    "picture_link": "ObgOhw2nfJn.uyYHnWftrPa7Jek46T2"
  },
  {
    "title": "Delicious Ham and Potato Soup",
    "ingredients": [
      "3 1/2 cups peeled and diced potatoes ADVERTISEMENT",
      "1/3 cup diced celery ADVERTISEMENT",
      "1/3 cup finely chopped onion ADVERTISEMENT",
      "3/4 cup diced cooked ham ADVERTISEMENT",
      "3 1/4 cups water ADVERTISEMENT",
      "2 tablespoons chicken bouillon granules ADVERTISEMENT",
      "1/2 teaspoon salt, or to taste ADVERTISEMENT",
      "1 teaspoon ground white or black pepper, or to taste ADVERTISEMENT",
      "5 tablespoons butter ADVERTISEMENT",
      "5 tablespoons all-purpose flour ADVERTISEMENT",
      "2 cups milk ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Combine the potatoes, celery, onion, ham and water in a stockpot. Bring to a boil, then cook over medium heat until potatoes are tender, about 10 to 15 minutes. Stir in the chicken bouillon, salt and pepper.\nIn a separate saucepan, melt butter over medium-low heat. Whisk in flour with a fork, and cook, stirring constantly until thick, about 1 minute. Slowly stir in milk as not to allow lumps to form until all of the milk has been added. Continue stirring over medium-low heat until thick, 4 to 5 minutes.\nStir the milk mixture into the stockpot, and cook soup until heated through. Serve immediately.\n",
    "picture_link": "Ve83fJ5ulFEOFoIjWsgDl8Ro56GAtby"
  },
  {
    "title": "Chicken Pot Pie IX",
    "ingredients": [
      "1 pound skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
      "1 cup sliced carrots ADVERTISEMENT",
      "1 cup frozen green peas ADVERTISEMENT",
      "1/2 cup sliced celery ADVERTISEMENT",
      "1/3 cup butter ADVERTISEMENT",
      "1/3 cup chopped onion ADVERTISEMENT",
      "1/3 cup all-purpose flour ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "1/4 teaspoon black pepper ADVERTISEMENT",
      "1/4 teaspoon celery seed ADVERTISEMENT",
      "1 3/4 cups chicken broth ADVERTISEMENT",
      "2/3 cup milk ADVERTISEMENT",
      "2 (9 inch) unbaked pie crusts ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 425 degrees F (220 degrees C.)\nIn a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside.\nIn the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside.\nPlace the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape.\nBake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving.\n",
    "picture_link": "39ec69lJMInLCpNnHSASWBMhWBjpd5i"
  },
  {
    "title": "Fluffy Pancakes",
    "ingredients": [
      "3/4 cup milk ADVERTISEMENT",
      "2 tablespoons white vinegar ADVERTISEMENT",
      "1 cup all-purpose flour ADVERTISEMENT",
      "2 tablespoons white sugar ADVERTISEMENT",
      "1 teaspoon baking powder ADVERTISEMENT",
      "1/2 teaspoon baking soda ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "1 egg ADVERTISEMENT",
      "2 tablespoons butter, melted ADVERTISEMENT",
      "cooking spray ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".\nCombine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.\nHeat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side.\n",
    "picture_link": "fLPXevtD6/zo9jBfqyM49TZDgLgnU1m"
  },
  {
    "title": "Good Old Fashioned Pancakes",
    "ingredients": [
      "1 1/2 cups all-purpose flour ADVERTISEMENT",
      "3 1/2 teaspoons baking powder ADVERTISEMENT",
      "1 teaspoon salt ADVERTISEMENT",
      "1 tablespoon white sugar ADVERTISEMENT",
      "1 1/4 cups milk ADVERTISEMENT",
      "1 egg ADVERTISEMENT",
      "3 tablespoons butter, melted ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.\n",
    "picture_link": "2UXAfMG0SH4NTh2LJLZc8A05sfDyc7u"
  },
  {
    "title": "Banana Crumb Muffins",
    "ingredients": [
      "1 1/2 cups all-purpose flour ADVERTISEMENT",
      "1 teaspoon baking soda ADVERTISEMENT",
      "1 teaspoon baking powder ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "3 bananas, mashed ADVERTISEMENT",
      "3/4 cup white sugar ADVERTISEMENT",
      "1 egg, lightly beaten ADVERTISEMENT",
      "1/3 cup butter, melted ADVERTISEMENT",
      "1/3 cup packed brown sugar ADVERTISEMENT",
      "2 tablespoons all-purpose flour ADVERTISEMENT",
      "1/8 teaspoon ground cinnamon ADVERTISEMENT",
      "1 tablespoon butter ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 10 muffin cups, or line with muffin papers.\nIn a large bowl, mix together 1 1/2 cups flour, baking soda, baking powder and salt. In another bowl, beat together bananas, sugar, egg and melted butter. Stir the banana mixture into the flour mixture just until moistened. Spoon batter into prepared muffin cups.\nIn a small bowl, mix together brown sugar, 2 tablespoons flour and cinnamon. Cut in 1 tablespoon butter until mixture resembles coarse cornmeal. Sprinkle topping over muffins.\nBake in preheated oven for 18 to 20 minutes, until a toothpick inserted into center of a muffin comes out clean.\n",
    "picture_link": "KtfWoJytrBqQMAQFzTK18Wvw2nrTaIi"
  },
  {
    "title": "Bailey's Irish Cream Brownies",
    "ingredients": [
      "2 (19.8 ounce) packages fudge brownie mix (such as Duncan Hines®) ADVERTISEMENT",
      "1 cup Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
      "2/3 cup vegetable oil ADVERTISEMENT",
      "2 eggs ADVERTISEMENT",
      "1 cup unsalted butter, softened ADVERTISEMENT",
      "5 tablespoons Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
      "4 cups confectioners' sugar ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nButter the bottom of a 10 1/2x15 1/2-inch jelly roll pan.\nPlace fudge brownie mix into a large bowl; beat in 1 cup of Irish cream liqueur, vegetable oil, and eggs until the mixture forms a smooth batter.\nSpread the batter into the prepared jelly roll pan.\nBake in the preheated oven until the brownies are set and a toothpick inserted into the center comes out clean, about 20 minutes. Remove pan from oven and allow to cool completely.\nBeat unsalted butter in a large bowl until smooth; beat in 5 tablespoons Irish cream liqueur until mixture is creamy.\nSlowly beat in confectioners' sugar, 1 cup at a time, until frosting is desired stiffness; spread frosting on brownies to serve.\n",
    "picture_link": "j9kandxcyu2SK5yNmK8yWjefb2xYdCG"
  },
  {
    "title": "Apple Pie by Grandma Ople",
    "ingredients": [
      "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
      "1/2 cup unsalted butter ADVERTISEMENT",
      "3 tablespoons all-purpose flour ADVERTISEMENT",
      "1/4 cup water ADVERTISEMENT",
      "1/2 cup white sugar ADVERTISEMENT",
      "1/2 cup packed brown sugar ADVERTISEMENT",
      "8 Granny Smith apples - peeled, cored and sliced ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.\nPlace the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust. Gently pour the sugar and butter liquid over the crust. Pour slowly so that it does not run off.\nBake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft.\n",
    "picture_link": "xPYFucX1WnuJ5ddvW6SGs44Hr7Y778y"
  },
  {
    "title": "Easy Irish Colcannon",
    "ingredients": [
      "2 pounds potatoes, peeled and cubed ADVERTISEMENT",
      "1 head cabbage, chopped ADVERTISEMENT",
      "1 bunch green onions, chopped ADVERTISEMENT",
      "1/4 cup butter, softened ADVERTISEMENT",
      "1/2 cup half-and-half cream ADVERTISEMENT",
      "salt and black pepper to taste ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Place the potatoes, cabbage, and green onions into a large sauce pan, fill with water, and bring to a boil. Reduce heat, cover, and simmer until the potatoes are tender, about 20 minutes.\nDrain the vegetables and place into a large bowl. Mash the potatoes and vegetables with the butter using a fork until the mixture is chunky, pouring in half-and-half gradually as you mash. Season with salt and pepper, and serve.\n",
    "picture_link": "q6phNiHdzKe8.iG1c8KSyyFxaeuY53m"
  },
  {
    "title": "Ang's Balsamic Maple Chicken",
    "ingredients": [
      "2 tablespoons maple syrup ADVERTISEMENT",
      "1 tablespoon balsamic syrup ADVERTISEMENT",
      "1/4 teaspoon garlic powder ADVERTISEMENT",
      "2 pinches cayenne pepper ADVERTISEMENT",
      "1 pinch ground white pepper ADVERTISEMENT",
      "1 pinch ground nutmeg ADVERTISEMENT",
      "1 pinch ground dried chipotle pepper ADVERTISEMENT",
      "3 skinless, boneless chicken breast halves ADVERTISEMENT",
      "1 tablespoon olive oil ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Whisk maple syrup, balsamic vinegar, garlic powder, cayenne pepper, white pepper, nutmeg, and chipotle pepper together in a small bowl until rub is smooth. Coat chicken on all sides with rub.\nHeat olive oil in a large skillet over medium-high heat. Cook chicken in hot oil until no longer pink in the center and juices run clear, 5 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
    "picture_link": "sf9JzBcRWe9QjxqeXANbq/Uotw707.q"
  },
  {
    "title": "Zesty Slow Cooker Chicken Barbecue",
    "ingredients": [
      "6 frozen skinless, boneless chicken breast halves ADVERTISEMENT",
      "1 (12 ounce) bottle barbeque sauce ADVERTISEMENT",
      "1/2 cup Italian salad dressing ADVERTISEMENT",
      "1/4 cup brown sugar ADVERTISEMENT",
      "2 tablespoons Worcestershire sauce ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Place chicken in a slow cooker. In a bowl, mix the barbecue sauce, Italian salad dressing, brown sugar, and Worcestershire sauce. Pour over the chicken.\nCover, and cook 3 to 4 hours on High or 6 to 8 hours on Low.\n",
    "picture_link": "GkR/dNxhTeZUdRTYREYfFQa9TrCNjJO"
  },
  {
    "title": "Chicken Cordon Bleu II",
    "ingredients": [
      "6 skinless, boneless chicken breast halves ADVERTISEMENT",
      "6 slices Swiss cheese ADVERTISEMENT",
      "6 slices ham ADVERTISEMENT",
      "3 tablespoons all-purpose flour ADVERTISEMENT",
      "1 teaspoon paprika ADVERTISEMENT",
      "6 tablespoons butter ADVERTISEMENT",
      "1/2 cup dry white wine ADVERTISEMENT",
      "1 teaspoon chicken bouillon granules ADVERTISEMENT",
      "1 tablespoon cornstarch ADVERTISEMENT",
      "1 cup heavy whipping cream ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Pound chicken breasts if they are too thick. Place a cheese and ham slice on each breast within 1/2 inch of the edges. Fold the edges of the chicken over the filling, and secure with toothpicks. Mix the flour and paprika in a small bowl, and coat the chicken pieces.\nHeat the butter in a large skillet over medium-high heat, and cook the chicken until browned on all sides. Add the wine and bouillon. Reduce heat to low, cover, and simmer for 30 minutes, until chicken is no longer pink and juices run clear.\nRemove the toothpicks, and transfer the breasts to a warm platter. Blend the cornstarch with the cream in a small bowl, and whisk slowly into the skillet. Cook, stirring until thickened, and pour over the chicken. Serve warm.\n",
    "picture_link": "ihSzemMJFm3PAc5Gjz7ClL3vrC17c1C"
  },
  {
    "title": "Chantal's New York Cheesecake",
    "ingredients": [
      "15 graham crackers, crushed ADVERTISEMENT",
      "2 tablespoons butter, melted ADVERTISEMENT",
      "4 (8 ounce) packages cream cheese ADVERTISEMENT",
      "1 1/2 cups white sugar ADVERTISEMENT",
      "3/4 cup milk ADVERTISEMENT",
      "4 eggs ADVERTISEMENT",
      "1 cup sour cream ADVERTISEMENT",
      "1 tablespoon vanilla extract ADVERTISEMENT",
      "1/4 cup all-purpose flour ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch springform pan.\nIn a medium bowl, mix graham cracker crumbs with melted butter. Press onto bottom of springform pan.\nIn a large bowl, mix cream cheese with sugar until smooth. Blend in milk, and then mix in the eggs one at a time, mixing just enough to incorporate. Mix in sour cream, vanilla and flour until smooth. Pour filling into prepared crust.\nBake in preheated oven for 1 hour. Turn the oven off, and let cake cool in oven with the door closed for 5 to 6 hours; this prevents cracking. Chill in refrigerator until serving.\n",
    "picture_link": "bLrpyFf9h6acX.fVtqmdTTu3yqIVliK"
  },
  {
    "title": "Baked Teriyaki Chicken",
    "ingredients": [
      "1 tablespoon cornstarch ADVERTISEMENT",
      "1 tablespoon cold water ADVERTISEMENT",
      "1/2 cup white sugar ADVERTISEMENT",
      "1/2 cup soy sauce ADVERTISEMENT",
      "1/4 cup cider vinegar ADVERTISEMENT",
      "1 clove garlic, minced ADVERTISEMENT",
      "1/2 teaspoon ground ginger ADVERTISEMENT",
      "1/4 teaspoon ground black pepper ADVERTISEMENT",
      "12 skinless chicken thighs ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "In a small saucepan over low heat, combine the cornstarch, cold water, sugar, soy sauce, vinegar, garlic, ginger and ground black pepper. Let simmer, stirring frequently, until sauce thickens and bubbles.\nPreheat oven to 425 degrees F (220 degrees C).\nPlace chicken pieces in a lightly greased 9x13 inch baking dish. Brush chicken with the sauce. Turn pieces over, and brush again.\nBake in the preheated oven for 30 minutes. Turn pieces over, and bake for another 30 minutes, until no longer pink and juices run clear. Brush with sauce every 10 minutes during cooking.\n",
    "picture_link": "OEYgIen90sBkOPUM5x0RYnh2/JsdYt6"
  },
  {
    "title": "Guacamole",
    "ingredients": [
      "3 avocados - peeled, pitted, and mashed ADVERTISEMENT",
      "1 lime, juiced ADVERTISEMENT",
      "1 teaspoon salt ADVERTISEMENT",
      "1/2 cup diced onion ADVERTISEMENT",
      "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
      "2 roma (plum) tomatoes, diced ADVERTISEMENT",
      "1 teaspoon minced garlic ADVERTISEMENT",
      "1 pinch ground cayenne pepper (optional) ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately.\n",
    "picture_link": ".zMxHuCd3eOs2OxJg0w.rtPemJ6.Kvy"
  },
  {
    "title": "Boilermaker Tailgate Chili",
    "ingredients": [
      "2 pounds ground beef chuck ADVERTISEMENT",
      "1 pound bulk Italian sausage ADVERTISEMENT",
      "3 (15 ounce) cans chili beans, drained ADVERTISEMENT",
      "1 (15 ounce) can chili beans in spicy sauce ADVERTISEMENT",
      "2 (28 ounce) cans diced tomatoes with juice ADVERTISEMENT",
      "1 (6 ounce) can tomato paste ADVERTISEMENT",
      "1 large yellow onion, chopped ADVERTISEMENT",
      "3 stalks celery, chopped ADVERTISEMENT",
      "1 green bell pepper, seeded and chopped ADVERTISEMENT",
      "1 red bell pepper, seeded and chopped ADVERTISEMENT",
      "2 green chile peppers, seeded and chopped ADVERTISEMENT",
      "1 tablespoon bacon bits ADVERTISEMENT",
      "4 cubes beef bouillon ADVERTISEMENT",
      "1/2 cup beer ADVERTISEMENT",
      "1/4 cup chili powder ADVERTISEMENT",
      "1 tablespoon Worcestershire sauce ADVERTISEMENT",
      "1 tablespoon minced garlic ADVERTISEMENT",
      "1 tablespoon dried oregano ADVERTISEMENT",
      "2 teaspoons ground cumin ADVERTISEMENT",
      "2 teaspoons hot pepper sauce (e.g. Tabasco™) ADVERTISEMENT",
      "1 teaspoon dried basil ADVERTISEMENT",
      "1 teaspoon salt ADVERTISEMENT",
      "1 teaspoon ground black pepper ADVERTISEMENT",
      "1 teaspoon cayenne pepper ADVERTISEMENT",
      "1 teaspoon paprika ADVERTISEMENT",
      "1 teaspoon white sugar ADVERTISEMENT",
      "1 (10.5 ounce) bag corn chips such as Fritos® ADVERTISEMENT",
      "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Heat a large stock pot over medium-high heat. Crumble the ground chuck and sausage into the hot pan, and cook until evenly browned. Drain off excess grease.\nPour in the chili beans, spicy chili beans, diced tomatoes and tomato paste. Add the onion, celery, green and red bell peppers, chile peppers, bacon bits, bouillon, and beer. Season with chili powder, Worcestershire sauce, garlic, oregano, cumin, hot pepper sauce, basil, salt, pepper, cayenne, paprika, and sugar. Stir to blend, then cover and simmer over low heat for at least 2 hours, stirring occasionally.\nAfter 2 hours, taste, and adjust salt, pepper, and chili powder if necessary. The longer the chili simmers, the better it will taste. Remove from heat and serve, or refrigerate, and serve the next day.\nTo serve, ladle into bowls, and top with corn chips and shredded Cheddar cheese.\n",
    "picture_link": "2EH/nRUUcgkSG/0rru1LVBhynKlCWdq"
  },
  {
    "title": "Baked Pork Chops I",
    "ingredients": [
      "6 pork chops ADVERTISEMENT",
      "1 teaspoon garlic powder ADVERTISEMENT",
      "1 teaspoon seasoning salt ADVERTISEMENT",
      "2 egg, beaten ADVERTISEMENT",
      "1/4 cup all-purpose flour ADVERTISEMENT",
      "2 cups Italian-style seasoned bread crumbs ADVERTISEMENT",
      "4 tablespoons olive oil ADVERTISEMENT",
      "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
      "1/2 cup milk ADVERTISEMENT",
      "1/3 cup white wine ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRinse pork chops, pat dry, and season with garlic powder and seasoning salt to taste. Place the beaten eggs in a small bowl. Dredge the pork chops lightly in flour, dip in the egg, and coat liberally with bread crumbs.\nHeat the oil in a medium skillet over medium-high heat. Fry the pork chops 5 minutes per side, or until the breading appears well browned. Transfer the chops to a 9x13 inch baking dish, and cover with foil.\nBake in the preheated oven for 1 hour. While baking, combine the cream of mushroom soup, milk and white wine in a medium bowl. After the pork chops have baked for an hour, cover them with the soup mixture. Replace foil, and bake for another 30 minutes.\n",
    "picture_link": "rZmNRXYwEzsfTnBgVQv8Cj/WY1lX8lS"
  },
  {
    "title": "Easy Sugar Cookies",
    "ingredients": [
      "2 3/4 cups all-purpose flour ADVERTISEMENT",
      "1 teaspoon baking soda ADVERTISEMENT",
      "1/2 teaspoon baking powder ADVERTISEMENT",
      "1 cup butter, softened ADVERTISEMENT",
      "1 1/2 cups white sugar ADVERTISEMENT",
      "1 egg ADVERTISEMENT",
      "1 teaspoon vanilla extract ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.\nIn a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.\nBake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks.\n",
    "picture_link": "eoHeMPwLYNOUuP7fEHJUxUAyOFDusE6"
  },
  {
    "title": "Slow Cooker Chicken Taco Soup",
    "ingredients": [
      "1 onion, chopped ADVERTISEMENT",
      "1 (16 ounce) can chili beans ADVERTISEMENT",
      "1 (15 ounce) can black beans ADVERTISEMENT",
      "1 (15 ounce) can whole kernel corn, drained ADVERTISEMENT",
      "1 (8 ounce) can tomato sauce ADVERTISEMENT",
      "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
      "2 (10 ounce) cans diced tomatoes with green chilies, undrained ADVERTISEMENT",
      "1 (1.25 ounce) package taco seasoning ADVERTISEMENT",
      "3 whole skinless, boneless chicken breasts ADVERTISEMENT",
      "1 (8 ounce) package shredded Cheddar cheese (optional) ADVERTISEMENT",
      "sour cream (optional) ADVERTISEMENT",
      "crushed tortilla chips (optional) ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Place the onion, chili beans, black beans, corn, tomato sauce, beer, and diced tomatoes in a slow cooker. Add taco seasoning, and stir to blend. Lay chicken breasts on top of the mixture, pressing down slightly until just covered by the other ingredients. Set slow cooker for low heat, cover, and cook for 5 hours.\nRemove chicken breasts from the soup, and allow to cool long enough to be handled. Stir the shredded chicken back into the soup, and continue cooking for 2 hours. Serve topped with shredded Cheddar cheese, a dollop of sour cream, and crushed tortilla chips, if desired.\n",
    "picture_link": "GWywt09r1TWhbEbOOmDDEHgmpqdsSk2"
  },
  {
    "title": "Grandmother's Buttermilk Cornbread",
    "ingredients": [
      "1/2 cup butter ADVERTISEMENT",
      "2/3 cup white sugar ADVERTISEMENT",
      "2 eggs ADVERTISEMENT",
      "1 cup buttermilk ADVERTISEMENT",
      "1/2 teaspoon baking soda ADVERTISEMENT",
      "1 cup cornmeal ADVERTISEMENT",
      "1 cup all-purpose flour ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 375 degrees F (175 degrees C). Grease an 8 inch square pan.\nMelt butter in large skillet. Remove from heat and stir in sugar. Quickly add eggs and beat until well blended. Combine buttermilk with baking soda and stir into mixture in pan. Stir in cornmeal, flour, and salt until well blended and few lumps remain. Pour batter into the prepared pan.\nBake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted in the center comes out clean.\n",
    "picture_link": "E1CxumC3GHM3i688RfZ.iRqqhE5dpvi"
  },
  {
    "title": "Baked Ziti I",
    "ingredients": [
      "1 pound dry ziti pasta ADVERTISEMENT",
      "1 onion, chopped ADVERTISEMENT",
      "1 pound lean ground beef ADVERTISEMENT",
      "2 (26 ounce) jars spaghetti sauce ADVERTISEMENT",
      "6 ounces provolone cheese, sliced ADVERTISEMENT",
      "1 1/2 cups sour cream ADVERTISEMENT",
      "6 ounces mozzarella cheese, shredded ADVERTISEMENT",
      "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain.\nIn a large skillet, brown onion and ground beef over medium heat. Add spaghetti sauce, and simmer 15 minutes.\nPreheat the oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish. Layer as follows: 1/2 of the ziti, Provolone cheese, sour cream, 1/2 sauce mixture, remaining ziti, mozzarella cheese and remaining sauce mixture. Top with grated Parmesan cheese.\nBake for 30 minutes in the preheated oven, or until cheeses are melted.\n",
    "picture_link": "IESYKnv/IXKkxm0iCAZE8jMA0pYYz5C"
  },
  {
    "title": "Janet's Rich Banana Bread",
    "ingredients": [
      "1/2 cup butter, melted ADVERTISEMENT",
      "1 cup white sugar ADVERTISEMENT",
      "2 eggs ADVERTISEMENT",
      "1 teaspoon vanilla extract ADVERTISEMENT",
      "1 1/2 cups all-purpose flour ADVERTISEMENT",
      "1 teaspoon baking soda ADVERTISEMENT",
      "1/2 teaspoon salt ADVERTISEMENT",
      "1/2 cup sour cream ADVERTISEMENT",
      "1/2 cup chopped walnuts ADVERTISEMENT",
      "2 medium bananas, sliced ADVERTISEMENT",
      "ADVERTISEMENT"
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.\nIn a large bowl, stir together the melted butter and sugar. Add the eggs and vanilla, mix well. Combine the flour, baking soda and salt, stir into the butter mixture until smooth. Finally, fold in the sour cream, walnuts and bananas. Spread evenly into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 60 minutes, or until a toothpick inserted into the center of the loaf comes out clean. Cool loaf in the pan for 10 minutes before removing to a wire rack to cool completely.\n",
    "picture_link": "nHcRmJipA0GfvSzOzomNZyuO/cIowE6"
  }
]
}